Revit 2027 API
Asset.AssetType Property
 The type of RenderingAsset
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AssetType AssetType { get; }
Public ReadOnly Property AssetType As AssetType
	Get
public:
property AssetType AssetType {
	AssetType get ();
}
member AssetType : AssetType with get
Property Value
AssetType
See Also
Reference
Asset Class
Autodesk.Revit.DB.Visual Namespace